#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "8d5b9fa12c30405736080daa71c425b1" -> "f4f39e74ff49e397a1c256aa70f77d40"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "0b8e46c88151bdc033e3e8f4d8e0d79b" -> "971fa727585ace967be39807a1d12e40"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "646e813ae81a09a5be5db49d76ff51e1" -> "b8fe113eca9072e8a054ef0c8d7e2427"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "31608d4771edbe7df46237367165d598" -> "c788d8679b8839ec28d6563d687a961b"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "6da87f3df951cb02412e1d60837abfd9" -> "ed137cefb7a869a360eeb157f8d52ad7"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "eb490f81f549b237e9925ec63d089026" -> "b46d0a990dfb8fe93ab125cec901d005"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "55605239913900afcede2cd6658f9d53" -> "c0b8b3f0ed805391029c9eebea05f68e"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "d6fcaa66ef94f44ac5d956d4f65e333c" -> "7d5bcdaaeb1c64c984fe2604a1d93437"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "d1d43a0cd739aafecde31faeab56824a" -> "5edb6c7552839e36bee905682b330fbd"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "3396e99c9983b742fcd53919ec42eb5d" -> "d853ae733c33f59e50c2e7b84b21208f"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "640fd7ddc1f75710302367eca66a8b42" -> "5977e29ba35e52efb119e641088ca716"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "64dc84e4ee774c3d5d779294dacee4f7" -> "f9195799d26ad66372f850e6baf342a0"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "3f2e7c1600941272623a2fab95cf180e" -> "89dfd33dcc7743cf31510ddf4abba729"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "83a9cdd10956edbf9e2d654047a950bc" -> "69ad298145d4cf2a952f63c02326eaaf"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "d190b265a9c12d66a183fc5bdc83c2e2" -> "04c8a05ffd432ba63b0468f645383e34"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.etl_script_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "etl_script_object" {
      ~ etag               = "f683b760a905beece321d1cf66f14290" -> "3e64822f9e7de7ad06d92a2f2623c305"
        id                 = "pyspark/kpinetwork_analizer.py"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "ed7ba1b922c32b6d7d5a3b761a44d5de" -> "d60d8ed2f1d9641f0697e96122855e78"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "8d5f06cf8014b9d2b8cf6df9d634ef9a" -> "e1af0f1fe52ea62a8dc2576f911e8f44"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "e97cca8e3a301d86967e2ed97efe65bf" -> "e1a94ceb7ae0d31bf5b19cf0f9d94f67"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "cc316c5f2344431051c203306af54c2c" -> "0e8f55175c343fd47ba26bf15e307398"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "fae8ce18b2494c0971e6b9b4c59ef3b1" -> "7f376e017d6e3409c8b2dd0e3105c99e"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "94b42f113d95349b89ec93eb869124f0" -> "ef3713524c2fadb78dae34f911715f2a"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "30d186d52f7a1fda7185270a4e0bd452" -> "da4ee8ecd30067ca56b5a7a48608c16c"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "1293d9d4879b20f63a6ace4d56efbd4c" -> "ff47c33d3b7d9b5104154f6c8e264d75"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "10bbe41a63092368c7a24a5ee70a8ec0" -> "f975bff57a66a9a3b9cabfa41a680796"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "e97b60079120ff8ee2502c3ad2272d49" -> "5aab78b65addb0c447eed271c4d05fd6"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "1bc63a2c8cea9a23d36d2e9452375c22" -> "660cefcba3bc91f36fda43818a23c005"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "5c0db2f84e12915d9c35ccfa25bd562f" -> "35ca6d1cedb0d2d72275973c4c82f133"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be created
  + resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "3fb37e21f86d3057ce5c76785223afda"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_full_year_total_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_full_year_total_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "c58fc279eecaa704fa61d23dccebf018" -> "aaf36941984ee09cd4a5b3be37edb931"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "6f901c5db70f6a757f2f090a941b3329" -> "9ef39d5aca671164e803e156e171ca33"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "b48a924c711f128e6b6c1dea75ebeb61" -> "e637c84728ae35d1f6107797264be9f9"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "f4cf45cf4da59807d7bc3add6ebdcf9c" -> "fd430869c19ece3b56f4ba38e9618e1d"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "aea4d3eacbc2e101faba6310deb3ef8d" -> "30dc2ccf743a4969d6efbdd98c743b13"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "596349635c8309f0b60203dedf91ec92" -> "616cb4eec3c945e8c819f75f13d5fc37"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "f964dd81fa9baaf22a15c78376ac96aa" -> "78418d641e6e2c63c6da205bb90493d6"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "8430fde4a46505e0c63269f653cc618a" -> "e8fc71965ffdce989956c4390dd5a30a"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "12ec5803e219218ef519c09a498e195e" -> "c4146253ba45b295052a0a2b894dfaa9"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "0d9c0fe46d1bf2ca5a33193bcdd11219" -> "b0ffdde614ca33d04ebd8ff3019bf6cc"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "98f9805f80e0f4bd00ea0e8d2e658d65" -> "e456657aa8fbc59f6f7c05c3c3503d06"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "eb55492815c9d733b43fde7d2c277219" -> "48556b4c7d6957b627138e8f2b6d818d"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "3f45285197c7ad1a6ef5cf2bd77d044b" -> "337d1398cd9fb4b243775e6dc27e5b07"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ff713039b565b818cd93f998bf31a194" -> "87e936ca54e2ca1f96ea4d4159725a4c"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "29dc4fa30204fdb044f203da3017aea2" -> "962d29ba32f49e7fac510ad6abd21cb3"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "f71032fe5a7416650d7cc7cf2a9ed7de" -> "291417741bbbb4edf25d44e3e01750e5"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "a7cb404c0b1e31209e141f0276faabfc" -> "ca604db3e985d7a186c15665461ad606"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "ec53ff9cefb92ebc0d2bf503ca055126" -> "51576def02a96a769e8c12a5c72e15f4"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "HL5+UEDb0+ImJlBFseLTVOxaSu+UBLqrcdtVCOFIfzs=" -> "3P2H/n/x6Xm+nmLOYYtkrx1I6RCguRWklD4aFcirI6c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "nkNHI4NuGGjXCKbEdI3f0FduG4GjlAJOl5RzbM9RuS4=" -> "WDOTsAYgeGI9X7KvoyJKlrMgIgcn0fJPfNZntuqskhk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "JwltGBy56hd4VeKIhVtEFkfW9YZrv//u8Q+qYmTVb9c=" -> "ASL+RDY3WfVhu8b2hgZz7q1GCJbGf4c0yE3c0stYjUA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "bPvCC1Ro9nbckUJrUdJh6KbQ9oO0VErEEpqPWBvbWhs=" -> "WmIjESTMZWZ0s3mbJdQS0XvuFtgeEzg++45KkwrbgEw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ICiyAP/D0ldSdjbS821FHQykHtfC5w4KwfWI3vo3BjM=" -> "BV4I2oXH0rV2V5Bintsd7m+D+KgmZ3TiPbr9nfc26CI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "aZgtybtTqu0kh97WJZgLXUg8HHNOklTGt2AK3jT1TcY=" -> "l53i2mRjQgfokbzjlwe2q2xfet/d9d8LKNAmJx4rOVw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "mbkyH9NCN+l7qG9Ys47qwGNJa1zCGv/f2ZQTFV+bmso=" -> "0MRhEvZDgkRDFGeneWhVDCo2tkMtqdfvKC+P/hRIsXE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "eAyWdw5SlXeG8/5fL5qXe75WKq3SKvUvR8Om7j5mhpw=" -> "g8a59IjakYNXO8hD/JB83QMqyhbtaJCuvaamArPM9hA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "fjEjFTtCNqRCOhBwu8Qei0X3uRdwjIAFNv2h7ima5YY=" -> "Slkftp1qKcKYij63/HSdqEvAgjgwMShaKqEIrizg4dE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "gixqEwVvfCGzWT60SjZ8DDRMogtHth5Uf8o3aj05x2k=" -> "kw3d580p6iBwbtG6xRYpdR+mUVXw/AczqWgDkPTdupc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "vGWmN6g5BfOybQrCj1PXsXs4gbIoVs9+Ao8xagWTYqY=" -> "adYkOmmQ52Dt3nQPNtHLpCLfXUqowuwOWUj8+s9uJ1I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "cFAf7hOxmH2DpswUNQbdpT0CLv1YWA5ZoeOs0Eh5zwg=" -> "jr1tKXm6aTdb38quuzw6+zGF1Yc/5NmOTj4qKCxEvIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "p+WFjEPFnAEvZELvDhs2vni2oXT7fIK4apsCu/pbA1Q=" -> "ItVWiWhvI0w3Ee3rXMej071KJzx+fEzypcHS/St1EGo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "td8JkdWP8+RjZv2Y5ERtWa5Nbb+fmNoSlGzmZKltrLM=" -> "MBRUHSEf4QSHMveOE91IkUCasY97Xem8KvxiO38tMmk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "g37OVJZYJJeGyyF9Jj0pJKsI5/dGYaJwCbWJ08gxIbA=" -> "vmknnWu+fKrBa1B1d+uW2DxzQrXMLfJOdi1fgnEPCXY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "llxQSwGbGWSabtsiaACaWCMeppLVXxyHGu11f1lDrxw=" -> "kA+OXLe63MeSgyfYMxHXcA9CjwU49Z9JJx8VzHSb8Ho="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "nh2JrHX0C7DZh7dPAbJszPYJRzqNKzv1RbEPDgF0Owo=" -> "4JkiwKBp3YboqzCooWDF526ROeQi+PbzXYpDeRNGazI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "DRn/AVVjNnrVmhueezOZeauShL0OGvOhnhuK0Qwe9aE=" -> "DthqGDCqbjrGV0326/4FA8FkzHzpGIZavjGtHCY3lCI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "qgqBAku81+gQDLq1HpP7W6Kw/qY5YB1o0yM0YSCBs/w=" -> "TazW9Wb0dJ+6mROjpXGf7+BmChypOgLKSaavy+ynUe8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "vOGQ55pszPgFPxShG0dEeitJWlcNbQpf9XEDJ5JGV+M=" -> "joiaOknvXV1Y6TFJCJCqtyfUvnyGHOYm9+slnxUBcIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "CxeKGfDCkZ5h9HWMg+CdirfyMgPiM3y2zgfEoVHXaMc=" -> "RUwLiWydWZrduQAL0TjJ3C2ZHlf7Q5xRmlJaG8cxUJk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "T2mPQLwFrU9dHush4aKHXzdYgwE6j1r2k01A/Gg6Mmw=" -> "y2KP18s/IcR6OYgo2qJtc1m9fNeMLG0A6oxAw+RNLkI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "pe4wKZnWzn1Japyvr7msxaTKfhwR3mh12/YvAAfdh7k=" -> "Tc87WQgAFo9rviXyqiTiGJM71FD6YGlhFyPRRzi0TUQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "MsZPm53mo7q10nrafJJpv7D7YNx55B0gyQyEgJH5Qb0=" -> "cotNDX77ogNRt457t4S8Psh23VckG0p7zn7OgMrCkOY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "aWZxjzqVEV23VpRFSm6QTmAzUCntaiamqBKH/qvHdVM=" -> "EGLiZzghaZ1M5pmJ6iE8+AydMyw2sk/SNSIVGhP4yYU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "mYQL3aL/urNdSgVUtVG+CuM5npaYcJYNpZ6uTphbmn0=" -> "gnslI4707lv6LIS3qXptxdMzhe5HCN1/8qaGSHtRGwg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "n5bTPMktZGi3OYPTdcFEh4JYhIdUMeQpuueQyHOk8Ew=" -> "70UQGmtXaBlyZ9qT2e5ZfTKcosWy/SOenus9Gw93C7Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be created
  + resource "aws_lambda_function" "get_full_year_total_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_full_year_total_lambda_function"
      + handler                        = "get_full_year_total_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_full_year_total_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "rDIUMkwxLx8P506bZQud6Vo8OMDVDnz+OEcCfEmaBas="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive value)
              + "DB_HOST"      = (sensitive value)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive value)
              + "DB_USERNAME"  = (sensitive value)
              + "SECRET_KEY"   = (sensitive value)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "bOH6hRx7F196GENntNOSzdkaIH4zizQ9HwOUUq62SzE=" -> "/P1zUJUXSQFOp9+zOgMryeHsDgQZpZQKb6YFv5ynFl8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "FSMelonSQaKbjeTkXKlPxyxXUF+4mL5RoX0qFpIPRnQ=" -> "TE0RgvoM2iTA1jGLgjuRtVYZxwE5/t2QETEb1lHi02s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "pCbLTBaWUElvoNajR1aby1Tj4Xq6StFmayYYzCRXW+Y=" -> "gzyLSCPGX6yTv2/JlplwxSUejuFs0/nCrOBjsgUNSWs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "x8CpkQWa7N2SBkZCjCkFP6byXOyOgFE6uvuJa+rRiK0=" -> "F6xqHSs1f+eril87RgdZWQDIMDgU3isuowuDfDBq+Ac="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "t4Ku/S1PV91UdL1p7BureAbHoiooKZxEIi0n+4F50/U=" -> "MUcMySPESkXQHQU22h9MDIyvFws6QF1hGejV+JV6sqs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "xe12215GJqo/pzm+YsEtwDlSp/JUji79lhYt3C/KPhQ=" -> "cc+4noxxwDLRBbeyycEOms6+NwFmCqJT2X8U9lmr3iY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "i3uqviyjNH+3BSrqKfM/E2+VIDQOAUWnzxk2OovaKAU=" -> "HqyUbalwHgakVFNSgu6YblNjRZrPnHEnifXYzevJVeg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "4WK9KWwwJXd2cRPCsFPJT8e+N95ZhSj1vJ3O7lEBBmA=" -> "rVYclzCCFJNdbVtVYUXhdbAC4HjJaBiPzNDSTO33/38="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "BZXdnc619kC2Z8n3/s2gEuE6QayygTp6bPiXunRgxeQ=" -> "Bgl8QVPvf/w588yZxPgMZzKq30HRE4gCkYlmvKCUTzc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "cCDOWcNTJm6qTL94+vhHDpfdsrgrYUGUJmy+UEYyurA=" -> "emQPV0uCfH1uxt8+HUrjStEYqN6lpHA+6dFkF5U0brc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCC/jxo0fvdXATbYwKllTbcx3F2rCcMlLgi+acLMTXc=" -> "YVez8qdUtVp/vf5EJRizTupMQLjppQCSWuL+A0pBmwM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "K1IlPvCPqmFqaawYXrrHsHCFVegcRcZ9faykVDVkOCQ=" -> "VTcOfps0ITw/Bl37aMF+JXxiRS1apqVMMIXbKNG65L4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "ArbrJZoCQcEcjbZsEbxAPUl3cUer7TnPsyZzEwHOoa0=" -> "nN12AtbgD8LIwpMV0XUc9F/Oy/ygaH/1VsJrAbGWMlg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "8Z1TNgRK4Kv1nmdbsQuSiJmkf1jZuLTVqVhjs/3xumw=" -> "NZojv2Typl1kNtcta7xicxo4AfxIWyy6ximOVhhXgdE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "pptKvO2fk1AdqP2edBkrbPBHfVSl4pKxCB1ylZF+IJw=" -> "eUHJ8E3fuhlVeb8sKAX9GQMB0GKYaNEbLxVXX9SUrl8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "A5lK1tYDSOVeRUXitKN7Vm8ZWzHHq+keyMDprsvKSJI=" -> "PK8+9lnwzBaSVOtQoQGlDJf24Fvjp8QeZ/eqXlo4Jqw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "mADLS7m8TnDfNVTnUoU+3gLYDy0CPfloDHidlD9mi7w=" -> "ZvsKM6Zxk+toTJcEqcQyuJQIOUeicbyK5NIHPSPEQYA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-29T16:39:18Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xszkdw" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-29T16:39:17Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_full_year_total_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_full_year_total_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_full_year_total_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_full_year_total_integration will be created
  + resource "aws_api_gateway_integration" "get_full_year_total_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_full_year_total_method will be created
  + resource "aws_api_gateway_method" "get_full_year_total_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.full_year will be created
  + resource "aws_api_gateway_resource" "full_year" {
      + id          = (known after apply)
      + parent_id   = "0ay34r2gi9"
      + path        = (known after apply)
      + path_part   = "full_year"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-29T16:39:16Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.get_full_year_total_lambda_exec_role will be created
  + resource "aws_iam_role" "get_full_year_total_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_full_year_total_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.get_full_year_total_cognito_policy will be created
  + resource "aws_iam_role_policy" "get_full_year_total_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_get_full_year_total_cognito_policy"
      + policy = (sensitive value)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.get_full_year_total_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_full_year_total_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_full_year_total_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_full_year_total_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_full_year_total_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_full_year_total_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_full_year_total_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_full_year_total_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_full_year_total_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive value)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 12 to add, 92 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*